* Notes
My personal notes about the project. Mainly for keeping track of time spent on different tasks
* Todos
** DONE add a readme
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-09-10 Sat 07:05] \\
  readme created
CLOCK: [2022-09-10 Sat 07:03]--[2022-09-10 Sat 07:05] =>  0:02
CLOCK: [2022-09-10 Sat 07:01]--[2022-09-10 Sat 07:03] =>  0:02
:END:
** DONE add dependencies to the readme
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-09-10 Sat 07:19] \\
  added dependencies to the readme
CLOCK: [2022-09-10 Sat 07:05]--[2022-09-10 Sat 07:19] =>  0:14
:END:
** DONE install java 17 on my machine
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-09-10 Sat 07:32] \\
  installed
CLOCK: [2022-09-10 Sat 07:22]--[2022-09-10 Sat 07:32] =>  0:10
:END:
** DONE build a docker image
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-09-10 Sat 11:29]
CLOCK: [2022-09-10 Sat 10:47]--[2022-09-10 Sat 11:29] =>  0:42
CLOCK: [2022-09-10 Sat 07:32]--[2022-09-10 Sat 07:40] =>  0:08
CLOCK: [2022-09-10 Sat 07:21]--[2022-09-10 Sat 07:22] =>  0:01
:END:
** DONE add docker-compose file
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-09-10 Sat 11:29]
CLOCK: [2022-09-10 Sat 07:20]--[2022-09-10 Sat 07:21] =>  0:01
:END:
** DONE add spring-boot actuator
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-09-10 Sat 11:29]
:END:
** TODO add redis to compose file
:LOGBOOK:
CLOCK: [2022-09-10 Sat 11:29]
:END:
* Clock
#+BEGIN: clocktable :scope file :maxlevel 10
#+CAPTION: Clock summary at [2022-09-10 Sat 11:35]
| Headline                           | Time   |      |
|------------------------------------+--------+------|
| *Total time*                       | *1:20* |      |
|------------------------------------+--------+------|
| Todos                              | 1:20   |      |
| \_  add a readme                   |        | 0:04 |
| \_  add dependencies to the readme |        | 0:14 |
| \_  install java 17 on my machine  |        | 0:10 |
| \_  build a docker image           |        | 0:51 |
| \_  add docker-compose file        |        | 0:01 |
#+END:
